In [5]:
import numpy as np
import pandas as pd

In [6]:
Student_Marks=[['Name',['A','B','C','D','E']],
               ['Ankit',[41,34,45,55,63]],
               ['Aravind',[42,23,34,44,53]],
               ['Lakshay',[32,23,13,54,67]],
               ['Gyan',[23,82,23,63,34]],
               ['Pranav',[21,23,25,56,56]]
              ]

In [7]:
Student_Marks

[['Name', ['A', 'B', 'C', 'D', 'E']],
 ['Ankit', [41, 34, 45, 55, 63]],
 ['Aravind', [42, 23, 34, 44, 53]],
 ['Lakshay', [32, 23, 13, 54, 67]],
 ['Gyan', [23, 82, 23, 63, 34]],
 ['Pranav', [21, 23, 25, 56, 56]]]

In [8]:
Student_Marks[2]

['Aravind', [42, 23, 34, 44, 53]]

In [9]:
len(Student_Marks)

6

In [10]:
SM={'Name':['A','B','C','D','E'],
               'Ankit':[41,34,45,55,63],
               'Aravind':[42,23,34,44,53],
               'Lakshay':[32,23,13,54,67],
               'Gyan':[23,82,23,63,34],
               'Pranav':[21,23,25,56,56]
              }

In [11]:
SM

{'Name': ['A', 'B', 'C', 'D', 'E'],
 'Ankit': [41, 34, 45, 55, 63],
 'Aravind': [42, 23, 34, 44, 53],
 'Lakshay': [32, 23, 13, 54, 67],
 'Gyan': [23, 82, 23, 63, 34],
 'Pranav': [21, 23, 25, 56, 56]}

In [12]:
SM=pd.DataFrame(SM)

In [13]:
sm=SM.set_index('Name').T

In [14]:
sm

Name      A   B   C   D   E
Ankit    41  34  45  55  63
Aravind  42  23  34  44  53
Lakshay  32  23  13  54  67
Gyan     23  82  23  63  34
Pranav   21  23  25  56  56

In [15]:
sm.sort_values(by=['B'],ascending=False)

Name      A   B   C   D   E
Gyan     23  82  23  63  34
Ankit    41  34  45  55  63
Aravind  42  23  34  44  53
Lakshay  32  23  13  54  67
Pranav   21  23  25  56  56

In [16]:
sm=pd.DataFrame(sm)

In [17]:
highest_B_Mark=sm['B'].max()
highest_B_Mark_Student=sm['B'].idxmax()

In [18]:
print(f"{highest_B_Mark_Student} scored the highest marks in subject B which was {highest_B_Mark}.")

Gyan scored the highest marks in subject B which was 82.

In [19]:
c_avg=sm['C'].mean()
c_avg

28.0

In [20]:
print(f"The average marks scored in C is {c_avg}.")

The average marks scored in C is 28.0.

In [21]:
total=sm.sum(axis=1)
percentage=(total/500)*100
percentage

Ankit      47.6
Aravind    39.2
Lakshay    37.8
Gyan       45.0
Pranav     36.2
dtype: float64

In [22]:
print(f"The highest percentage is scored by {percentage.idxmax()} which is {round(percentage.max(),1)}.")

The highest percentage is scored by Ankit which is 47.6.

In [23]:
Ankit_Aravind=SM.sort_values(by=['Ankit'],ascending=False)

In [24]:
Ankit_Aravind

  Name  Ankit  Aravind  Lakshay  Gyan  Pranav
4    E     63       53       67    34      56
3    D     55       44       54    63      56
2    C     45       34       13    23      25
0    A     41       42       32    23      21
1    B     34       23       23    82      23

In [56]:
sum_Ankit=Ankit_Aravind['Ankit'].head(4).sum()

In [58]:
sum_Ankit

204

In [46]:
sum_Aravind=Ankit_Aravind['Aravind'].head(4).sum()
sum_Aravind

173

In [48]:
Lakshay_Gyan=SM.sort_values(by=['Lakshay'],ascending=False)
Lakshay_Gyan

  Name  Ankit  Aravind  Lakshay  Gyan  Pranav
4    E     63       53       67    34      56
3    D     55       44       54    63      56
0    A     41       42       32    23      21
1    B     34       23       23    82      23
2    C     45       34       13    23      25

In [50]:
Sum_Lakshay=Lakshay_Gyan['Lakshay'].head(4).sum()
Sum_Lakshay

176

In [52]:
Sum_Gyan=Lakshay_Gyan['Gyan'].head(4).sum()
Sum_Gyan

202

In [29]:
Pranav=SM.sort_values(by=['Pranav'],ascending=False)
Pranav

  Name  Ankit  Aravind  Lakshay  Gyan  Pranav
3    D     55       44       54    63      56
4    E     63       53       67    34      56
2    C     45       34       13    23      25
1    B     34       23       23    82      23
0    A     41       42       32    23      21

In [70]:
Sum_Pranav=Pranav['Pranav'].head(4).sum()
Sum_Pranav

160

In [60]:
Percent_Ankit = sum_Ankit/400
Percent_Ankit

0.51

In [62]:
Percent_Aravind = sum_Aravind/400
Percent_Aravind

0.4325

In [64]:
Percent_Lakshay = Sum_Lakshay/400
Percent_Lakshay

0.44

In [66]:
Percent_Gyan = Sum_Gyan/400
Percent_Gyan

0.505

In [72]:
Percent_Pranav = Sum_Pranav/400
Percent_Pranav

0.4

In [78]:
Percent_Max_4subjects=max(Percent_Ankit,Percent_Aravind,Percent_Lakshay,Percent_Gyan,Percent_Pranav)
Percent_Max_4subjects

0.51

In [80]:
print(f"The highest percentage is scored by Ankit and it is %0.03f." %(Percent_Max_4subjects))

The highest percentage is scored by Ankit and it is 0.510.